Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: །མ་རིག་གཏི་མུག་མུན་པས་བསྒྲིབས་པ་དག །ལྟ་བ་ལོག་ཞུགས་ཕྱིན་ཅི་ལོག་མཐོང་བས།
en: Obscured by the darkness of ignorance and stupidity, Following wrong views, and having heretical viewpoints,

source: །དགུང་ལོ་མང་པོར་དགུང་ཆར་བབ་མ་གྱུར།
en: And therefore for many years the rains did not fall.

source: །དགུང་ཆར་མ་བབ་ས་བོན་ཆབ་འཚལ་ཏེ།
en: ‘When the rains did not fall, seeds died,

source: །ལོ་ཐོག་མི་འཁྲུངས་ཞུགས་ཤིང་འཁྲུངས་མ་གྱུར།
en: The harvests did not grow, trees did not grow,

source: །མཚོ་དང་ལུ་མ་ཆུ་ཕྲན་རྒྱུད་ཀྱང་སྐམས།
en: Lakes, ponds, and streams dried up,

source: །ནགས་ཚལ་རྩི་ཤིང་ཀུན་ཀྱང་དེ་བཞིན་ཏེ།
en: And it was the same for all the forests and plants.

source: །རྣམ་དག་སྤྱན་ཁྱོད་འཁྲུངས་པར་མ་གྱུར་པས།
en: ‘When you, who have pure eyes, had not been born,

source: །ཆབ་ཀླུང་ཀུན་ཀྱང་མ་ལུས་སྐམས་པར་གྱུར།
en: Every river, without exception, had dried up.

source: །བཟའ་ཤིང་ར་བ་ཀུན་ཀྱང་རི་དགོན་འདྲ།
en: All orchards resembled desolate mountains,

source: །རུས་པ་དཀར་པོས་དོག་ས་གཏམས་པར་གྱུར།
en: And the ground was covered with white bones.

source: །གང་ཚེ་ཁྱོད་ལ་སློང་བ་མང་འདུས་ཏེ།
en: ‘When you gathered together a multitude of supplicants

source: །སློང་བ་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་མཛད་ནས།
en: And brought satisfaction to all those supplicants,

source: །ཕྱོགས་བཞི་ཀུན་ནས་སྤྲིན་ཆེན་འདུས་པར་གྱུར།
en: Great clouds gathered from all four directions,

source: །ཐང་དང་གཤོང་རྣམས་ཀུན་ཀྱང་ངོམས་པར་བགྱིས།
en: Bringing satisfaction to all plains and lowlands.

source: །སླན་ཅད་རྐུན་ཆོམ་གཡོན་ཅན་ཆད་པར་གྱུར།
en: ‘Since then there has been no thieving, robbery, or fraud.

source: །དགུམ་པ་མ་མཆིས་སུའང་གཟུང་མ་མཆིས།
en: There has been no murder and no executions.

source: །མགོན་མེད་གང་ཡང་འགུམ་པར་མི་འགྱུར་ཏེ།
en: No one has died because they had no protector.

source: །ཁྱོད་ནི་འགྲོ་བ་མགོན་མེད་ཀུན་གྱི་སྐྱབས།
en: You have become the protector for all beings who have none.

source: །སྲོག་གཅོད་པ་ལ་མངོན་པར་མོས་པའི་མྱི།
en: ‘Those humans who delighted in killing,

source: །གཞན་རྣམས་བཀུམ་ཞིང་དེ་ཡི་ཁྲག་འཚལ་ལ།
en: Who slew others and then drank their blood,

source: །གཅིག་ལ་གཅིག་གི་ཤ་འཚལ་གྱུར་པ་དག །ཁྱོད་ཀྱི་སྦྱིན་པ་ཆེན་པོས་བྱམས་སེམས་གྱུར།
en: And those who ate one another’s flesh, Through your great generosity now have benevolent minds. “ ‘At that time, those who possessed clothes

source: །བརྒྱ་སྟོང་གྲངས་སུ་འགྲངས་པར་གྱུར་པ་ལས། །དེ་ཚེ་འགའ་ཞིག་རད་པ་འཚལ་གྱུར་གྱིས།
en: Numbered no more than one hundred thousand.

source: །གཞན་ནི་རྩྭ་དང་ལོ་མར་ད་འཚལ།
en: The others covered their bodies with clothing of straw and leaves,

source: །དེ་ཚེ་ཀུན་ཀྱང་ཡི་དགས་བཀྲེས་མནར་བཞིན།
en: And at that time, all were tormented by hunger as pretas are.

source: །འགྲོ་བ་མགོན་མེད་མགོན་དུ་ཁྱོད་འཁྲུངས་ནས།
en: ‘You were born as a protector for those without a protector.

source: །ས་བོན་མ་བཏབ་མ་རྨོས་འབྲས་ཀྱང་བྱུང་།
en: Now even rice grows without being planted, without plowing.

source: །དཔག་བསམ་ཤིང་ལས་མཛོད་རྣམས་རྣམ་པར་འཐོན།
en: Treasures are obtained from wish-fulfilling trees,

source: །སྐྱེས་པ་བུད་མྱེད་མཁས་པ་གདའ་བར་གྱུར།
en: And men and women have become learned.

source: །ཟླ་བ་ཟླ་ཕྱེད་དོན་དུ་སྔོན་ཅད་ནི།
en: ‘In the past, for a month or half a month they would

source: །ལམ་ནོར་གནས་པ་སྩོགས་ཤིང་སྲི་ཞུར་བགྱིད།
en: Follow bad ways, working to accumulate to no avail.

source: །དེང་སང་རད་པ་རབ་འཚལ་རྒྱན་མང་ལྡན།
en: But nowadays they have much jewelry and excellent clothing

source: །དགའ་བའི་གནས་ན་རྩེ་བའི་ལྷ་ཡང་འདྲ།
en: And are always happy, like devas amusing themselves.

source: །སླན་ཆད་ལོག་པ་རྣམས་ལ་མི་ཟད་ཞུགས།
en: ‘Previously, passionate men, with dreadful wrong conduct,

source: །ཆོས་ངན་འདོད་ཆགས་མྱི་རྣམས་ཞེན་ཅིང་ཆགས།
en: Because of their desires and contrary to the Dharma,

source: །ན་ཆུང་གཞོན་ནུ་གཞན་གྱིས་བསྲུངས་པ་རྣམས། །ནན་གྱིས་ཕྲོགས་རློམ་ཆབ་འཚལ་མ་རུངས་བགྱིས།
en: Would forcefully take away and rape young maidens Who were under the protection of others. “ ‘Today, just on seeing the perfumed wives of others,

source: །ལྷ་མོ་བཟང་མོའི་ཁ་དོག་གཟུགས་ལྡན་པ།
en: With the bodies and complexions of beautiful apsarases,

source: །ཆ་གོས་བཟང་རྒྱན་ལྡན་པ་དེང་སང་མཐོང་གྱུར་ཏེ།
en: Wearing splendid clothes and adorned in jewelry,

source: །གཞན་གྱི་བུད་མེད་སྤོས་དྲི་གདའ་མཆིས་ཀྱང་། །དགའ་ལྡན་ཇི་བཞིན་མཆིས་འབྲད་རྒྱན་གྱིས་འཚལ།
en: They become satisfied as if by their own wives in Tuṣita.

source: །སྔན་ཅད་གཡོ་སྒྱུའི་དབང་གིས་ངག་ཏུ་བརྗོད།
en: ‘In the past, people spoke for the purpose of deception. They lied, spoke harshly, slandered, and spoke meaninglessly.

source: །དེང་སང་ཚིག་གི་ནོངས་པ་བཞི་སྤངས་ཤིང་།
en: Nowadays they have abandoned those four faults of speech,

source: །ལྟ་བ་ངན་སྤངས་ཆོས་ལ་ཀུན་ཀྱང་སྤྱོད།
en: Have abandoned wrong views, and completely practice the Dharma.

source: །ཚངས་དབྱངས་ཀ་ལ་པིང་ཀའི་སྒྲར་འབྱུང་བའི།
en: ‘Even the most melodious music And this divine singing do not come close

source: །ཁྱོད་ཀྱི་གསུང་མཆོག་འདི་ཡི་ཆ་ཤས་ལའང་།
en: To a fraction of your supreme speech,

source: །རོལ་མོ་སྒྲ་དབྱངས་ཤིན་ཏུ་སྙན་པ་དང་། །ལྷ་རྫས་གླུ་དབྱངས་འདི་དག་ཉེར་མྱི་འགྱུར།
en: Which emerges as the sound of Brahmā’s voice or of the avadavat.

source: །ཁྱོད་ཀྱི་སྤྱི་གཙུག་དབུ་སྟེང་གདུགས་ལྡིང་བ།
en: ‘Above the crown of your head floats a parasol

source: །རིན་ཆེན་རྒྱུས་བགྱིས་གསེར་གྱི་དྲ་བས་བཀབ།
en: Made of precious materials and covered by a net of gold,

source: །དཔལ་གྱི་སྙིང་མཛོད་ཡུ་བ་བཻཌུརྱ།
en: With a glorious center of treasure and a handle of beryl

source: །ཀུན་ནས་རིན་ཆེན་མཆོག་གི་དྲིལ་གྱིས་འཁོར།
en: And encircled by completely precious, excellent bells.

source: །དྲིལ་ལས་བྱུང་བའི་སྒྲས་ཀྱང་མ་ལུས་པའི།
en: ‘All the sounds that come from those bells

source: །འཇིག་རྟེན་སྒྲ་དབྱངས་མ་ལུས་ཟིལ་མནན་ཅིང་།
en: Outshine all the music in this world.

source: །སངས་རྒྱས་གསུང་གི་ཡན་ལག་འདྲ་བར་འཁྲོལ།
en: They emit sounds like the aspects of the Buddha’s speech,

source: །དམ་པའི་ཆོས་ཀྱི་སྒྲ་དབྱངས་ཞི་བ་སྒྲོག །དེ་ཐོས་སེམས་ཅན་ཉོན་མོངས་ཞི་བར་བགྱིད།
en: Resounding with the peaceful sounds of the Dharma.

source: །མ་ལུས་ཕྱོགས་ཀྱི་ཞིང་རྣམས་བརྒྱུད་པ་ཡི།
en: ‘The kleśas cease in all beings who hear

source: །བསྐལ་པ་རྒྱ་མཚོའི་བདེ་གཤེགས་རྒྱ་མཚོ་དང་། །བློ་ལྡན་རྒྱ་མཚོའི་མཚན་གྱི་འཁོར་ལོ་རྣམས།
en: The wheels of the names of the ocean of wise ones, Of the ocean of sugatas in the ocean of successive kalpas In the realms in all directions, without exception. “ ‘Through your blessing, the bells sound out In correct sequence whatever the names

source: །སྔོན་མཐའི་ཞིང་རྣམས་གཅིག་ནས་གཅིག་བརྒྱུད་དུ།
en: Of those who have appeared in the past, in one realm after another,

source: །གང་མཚན་གང་དང་གང་ལགས་རིམ་བཞིན་དང་། །མ་ལུས་ཕྱོགས་སུ་དམ་ཆོས་འཁོར་ལོ་ཡང་།
en: And turned the wheel of the Dharma in all directions without exception.

source: །ཁྱོད་ཀྱི་བྱིན་གྱིས་དྲིལ་རྣམས་རབ་ཏུ་སྒྲོག །ཁྱོད་ཀྱི་དྲིལ་སྒྲ་ཐོགས་པ་མ་མཆིས་པར།
en: ‘For as long as your bells continue to ring,

source: །ཚངས་དབང་ལྷ་དབང་འགྲོ་བའི་བདག་པོ་རྣམས།
en: They will resound throughout Jambudhvaja,

source: །རང་རང་ལས་ཀྱི་ཚུལ་ནི་ཀུན་བརྗོད་ཅིང་།
en: Describing the nature of the karma of each one Of the lords of Brahmās, the lords of devas, and the lords of humans.

source: །འཛམ་བུའི་རྒྱལ་མཚན་ཁྱབ་པར་ཀུན་ཏུ་སྒྲོག །དྲིལ་གྱི་སྒྲ་ལས་ལྷ་དང་མི་རྣམས་ཀྱིས།
en: ‘From the sound of the bells, each deva and human

source: །རང་རང་ལས་ཀྱི་ཚུལ་རྒྱུད་ཐོས་གྱུར་ནས།
en: Hears the nature of their individual karma,

source: །སྡིག་ཏོ་རྣམས་སྤངས་དགེ་བ་སྤྱོད་པར་གྱུར།
en: So they give up bad actions, adopt good conduct,

source: །སངས་རྒྱས་བྱང་ཆུབ་མཆོག་ལ་ཀུན་ཀྱང་གནས།
en: And are all directed to the supreme enlightenment of buddhahood.

source: །ཁྱོད་ཀྱི་ཡབ་ནི་མི་བདག་སྐར་མའི་འོད།
en: ‘Your father was the sovereign over humans, Jyotiṣprabha

source: །དེ་ཡི་བཙུན་མོ་པདྨོ་ཁྱོད་ཀྱི་ཡུམ།
en: And his Queen, Padmaprabhā, was your mother.

source: །རྙོག་པ་ལྔ་རྣམས་ཤིན་ཏུ་རྒྱས་གྱུར་དུ།
en: In the time when the five deteriorations spread,

source: །ཆོས་འགྲིབ་རྒྱལ་སྲིད་དེས་ནི་བཞེས་པར་གྱུར།
en: He had inherited the Dharma kingdom.

source: །དེ་ཡི་བཟའ་ཤིང་ར་བ་ཡངས་བྱུང་བ།
en: ‘His royal gardens were vast,

source: །མེ་ཏོག་རྒྱས་བརྒྱན་རིན་ཆེན་སྒྲོན་མ་སྟེ།
en: Arrayed with blossoming flowers and precious lamps,

source: ཤིང་མང་བརྒྱས་བསྐོར་རྫིང་བུ་ལྔ་བརྒྱ་ཡིས། །དེ་ནི་ཤིན་ཏུ་བརྒྱན་པ་བྱུང་བར་གྱུར།
en: Beautified by five hundred lotus ponds, Encircled by many hundreds of trees.

source: །དེ་དག་སོ་སོ་རེ་རེའི་ངོགས་སུ་ཡང་།
en: ‘And each of them had on every side

source: །ཀ་བ་སྟོང་ལྡན་གཞལ་མེད་ཁང་བཟངས་བྱུང་།
en: A palace with a thousand pillars,

source: །སྟེགས་བུ་བཟང་པོ་སྣ་ཚོགས་སྟོང་གིས་བརྒྱན།
en: A variegated array of a thousand balconies,

source: །ཟླ་གམ་དྲ་བས་ཀུན་ནས་མཛེས་པར་བགྱིས།
en: And beautifying nets of crescents everywhere.

source: །ཆོས་ངན་སྟོབས་ནི་རབ་ཏུ་འཕེལ་གྱུར་པས།
en: ‘The power of bad qualities became widespread,

source: །རྫིང་བུ་ཀུན་གྱི་ཆབ་དང་ཞུགས་ཤིང་རྣམས།
en: At that time, the water in all the lotus ponds,

source: །དེ་ཚེ་ལོ་མ་མདོག་དང་བཅས་ཏེ་སྐམས།
en: And the trees with all their leaves, dried up.

source: དགུང་བདུན་ན་ནི་ཁྱོད་བལྟམ་གྱུར་པའི་ཚེ།
en: ‘For seven nights before you were born,

source: །དེ་ཚེ་ངོ་མཚར་རྨད་བྱུང་ལྟས་བྱུང་སྟེ།
en: There were marvelous, wonderful omens.

source: །དེ་དག་མཐོང་ནས་སེམས་ཅན་ངེས་རྟོགས་པར།
en: When beings saw them, they said with certainty,

source: །བདག་ཅག་སྐྱོབ་པ་ངེས་པར་འབྱུང་ཞེས་མཆིས།
en: “Our savior has definitely arrived.”

source: །དགུང་གི་གུང་ལ་བབ་ནས་རྣམ་དྲུག་དུ།
en: ‘At the midnights of those nights,

source: །ཁམས་ཀྱི་དོགས་ཡོངས་སུ་གཡོས་པར་གྱུར།
en: The entire surface of the world shook in six ways.

source: །མ་སྨད་ཤིན་ཏུ་བཟང་བའི་རྫིང་དེ་ཡི།
en: In the center of the supreme lotus pond,

source: །དབུས་སུ་གདུགས་དང་མཉམ་པའི་འོད་ཅིག་བྱུང་། །ཆབ་བཟང་ཡན་ལག་བརྒྱད་ལྡན་རྒྱས་པར་གྱུར།
en: There appeared a light as bright as the sun.

source: །རྫིང་བུ་ལྔ་བརྒྱ་ཀུན་ཀྱང་དེ་བཞིན་ཏེ།
en: ‘All five hundred lotus ponds were filled With excellent water that had the eight qualities.

source: །ཞུགས་ཤིང་ཀུན་ཀྱང་ལོ་མ་འཁྲུངས་པར་གྱུར།
en: On the branches of the trees grew leaves

source: །མེ་ཏོག་འབྲས་བུ་ཁ་དོག་མདོག་དང་ལྡན།
en: And magnificent flowers and fruits.

source: །རྫིང་བུ་དེ་རྣམས་ཆབ་ཀྱིས་བལྟམ་གྱུར་པས།
en: ‘Those lotus ponds filled with water

source: །ནགས་ཚལ་མ་ལུས་དེ་དག་ངོམས་པར་བགྱིས།
en: Satisfied entire forests without exception.

source: །ཆབ་ཆེན་དེ་ལས་བྱུང་བའི་རྒྱུད་འཕྲོས་པས།
en: The great rivers that flowed from them

source: །འཛམ་བུའི་རྒྱལ་མཚན་ཆབ་ཀྱིས་བལྟམ་པར་གྱུར།
en: Filled Jambudhvaja with their water.

source: །ཞུགས་ཤིང་སྨན་དང་ལོ་ཐོག་ལྡུམ་བུ་ཡང་།
en: ‘The trees, herbs, crops, and plants grew.

source: །འཁྲུངས་གྱུར་ཞུགས་ཤིང་མེ་ཏོག་འབྲས་བུ་རྒྱས།
en: Trees were covered with flowers and fruits.

source: །དོག་སའི་སྟེང་ན་མཆིས་དགུའི་ས་བོན་རྣམས།
en: The many kinds of seeds on the surface of the world

source: །ཀུན་ཀྱང་ཆབ་ཀྱིས་བརླན་པས་རྣམ་པར་འཁྲུངས།
en: Were all moistened by the water and sprouted.

source: །ཆབ་ཀྱིས་བདས་གྱུར་དོག་སའི་ཕྱོགས་རྣམས་ཀྱང་།
en: ‘The surface of the earth was saturated with water,

source: །དེ་ཚེ་ཐམས་ཅད་རབ་ཏུ་མཉམ་པར་གྱུར།
en: So at that time it became completely level

source: །སྒང་གཤོང་དོག་སའི་ཕྱོགས་རྣམས་ཇི་སྙེད་པ།
en: All the upland and downland in all directions

source: །དེ་དག་ཀུན་ཀྱང་དེ་ཚེ་མཉམ་པར་གྱུར།
en: On the world’s surface became level

source: །གཡང་ས་གྲོག་པོ་མི་བདེ་ཕྱོགས་ཀྱི་རྣམས།
en: ‘At that time, chasms, precipices, and rugged places

source: །དེ་ཚེ་ཡུད་ཀྱིས་ཀུན་ཀྱང་མཉམ་པར་གྱུར།
en: All became level , everywhere in an instant.

source: །ཚེར་མ་གསེག་མ་ལ་སྩོགས་མ་མཆིས་གྱུར།
en: Thorns and pebbles and so on ceased to exist,

source: །རིན་ཆེན་བཟང་པོའི་འབྱུང་གནས་ཡོངས་སུ་འཐོན།
en: And sources of excellent jewels appeared.

source: །སྐྱེས་པ་བུད་མེད་ཚོགས་རྣམས་དགའ་བར་གྱུར།
en: ‘Crowds of men and women were rapturous,

source: །སྐོམ་པས་གདུངས་བ་ཀུན་ཀྱང་ཆབ་ལ་འཚལ། །ཀྱེ་མ་དེ་རིང་བདེ་ན་སུ་མཐུ་ཤེས།
en: And all who were afflicted by thirst had plenty of water.

source: །སྙན་པར་བརྗོད་པ་དེ་སྐད་ཆད་ཏུ་བརྗོད།
en: With happy voices they cried out in joy, Through whose power has today’s happiness come?”

source: །དོག་སའི་མངའ་བདག་སྐར་འོད་སྲས་དང་བཅས།
en: ‘At that time, the ruler of the earth, Jyotiḥprabha, and his son,

source: །སྲས་མོ་བློན་པོའི་ཚོགས་བཅས་དེ་ཡི་ཚེ།
en: Together with his daughters and a crowd of his ministers

source: །སྐྱེ་བོ་བྱེ་བ་སྟོང་གིས་ཡོངས་བསྐོར་ཏེ།
en: And encircled by a thousand million people,

source: །བཟའ་ཤིང་ར་བར་དགྱེས་པར་གཤེགས་པ་མཛད།
en: Proceeded to the gardens with delight. “ ‘Together with his queen he came up onto The terrace of the staircase of righteousness

source: །མདངས་དགའ་རྫིང་ཆེན་ཡོངས་སུ་མ་སྨད་པ།
en: Of the charming, preeminent, central

source: །སྤོས་ཆུས་བལྟམས་པ་དབུས་ན་མཆིས་གྱུར་པའི། །དེ་ཡི་དབུས་སུ་ཆོས་སྟེགས་བཟང་པོ་ཡི། །ཕོ་བྲང་སྟེང་གཤེགས་བཙུན་མོ་བཅས་པར་བཞུགས།
en: Lotus pond filled with scented water.

source: །དགུང་བདུན་ལོན་པར་གྱུར་ནས་དེ་ཡི་ཆབ།
en: ‘For the duration of seven nights,

source: །དགུང་གི་གུང་ལ་གྱེན་དུ་ལུད་པར་གྱུར།
en: Each night the water rose upward, And at that time the entire surface of the earth,

source: །རི་དང་གཞལ་མེད་ཁང་གི་ཕྲེང་བཅས་པའི། །དོག་སའང་དེ་ཚེ་ཡོངས་སུ་གཡོས་པར་གྱུར།
en: With its mountains and garlands of palaces, was shaken.

source: །ཡོངས་སུ་མ་སྨད་དེ་ཡི་དབུས་ནས་ཀྱང་།
en: ‘In the center of the preeminent pond

source: །པདྨོ་ཆེན་པོ་ལོ་མ་སྟོང་ལྡན་འཁྲུངས།
en: Appeared a great lotus with a thousand petals

source: །གདུགས་སྟོང་མདོག་གསལ་སྤྲིན་གྱི་དྲ་བ་ཅན།
en: And a net of clouds of the light of a thousand suns

source: །རི་རབ་རྩེ་མོ་མན་ཅད་འོད་ཀྱིས་འགེངས།
en: Spreading upward as far as Sumeru ’s summit.

source: །ཆུ་བ་རྡོ་རྗེ་ནང་རིམ་དྲི་གདའ་སྟེ།
en: ‘It had a diamond stem and an aromatic center.

source: །རིན་ཆེན་དབང་པོའི་ལོ་མ་རྣམ་དག་ཡངས།
en: Its multitude of pure petals were lords of jewels.

source: །འཛམ་བུ་ཆུ་ཀླུང་གསེར་བཟང་སྙིང་པོ་ཅན།
en: Its pericarp was splendid Jambu River gold.

source: །ཟེ་བ་སྤོས་རབ་འབར་བ་ཕུན་སུམ་ཚོགས།
en: It had a perfection of bright stamens with an excellent aroma.

source: །མགོན་པོ་ཁྱོད་ནི་དེ་ཡི་སྙིང་པོ་ལས།
en: ‘You, lord, were born upon that pericarp.

source: །སྐྱིལ་མོ་ཀྲུང་བཅས་སྐུ་ནི་བྱུང་བར་གྱུར།
en: You appeared sitting cross-legged,

source: །མཚན་གྱིས་རྣམ་བརྒྱན་ཡན་ལག་ཤིན་ཏུ་མཛེས།
en: Your beautiful body adorned by the signs of a great being,

source: །ལྷ་མང་བརྒྱས་ཀྱང་མངོན་པར་མཆོད་པ་བགྱིས།
en: With hundreds of devas making offerings to you.

source: །རྒྱལ་པོ་ཕོ་བྲང་སྟེང་ནས་ཤོད་གཤེགས་ཏེ།
en: ‘The king descended from the terrace’s platform.

source: །ཕྱག་གཉིས་བརྐྱང་སྟེ་ལེགས་པར་ཁྱོད་བླངས་ནས།
en: He reached out with his arms and lifted you up,

source: །བཙུན་མོའི་མགོ་ལ་བཞག་སྟེ་འདི་སྐད་གསུངས།
en: Gave you to the supreme queen, and said these words:

source: །ཁྱོད་ཀྱི་བུ་འདི་ཡིན་གྱིས་དགར་གྱིས་ཤིག །འཇིག་རྟེན་མགོན་ཁྱོད་དེ་ལྟར་བལྟམས་གྱུར་ཚེ།
en: “This is your son! Be of happy mind!” “ ‘When you, protector of the world, were thus born,

source: །བྱེ་བའི་གཏེར་རྣམས་རབ་ཏུ་འཐོན་པར་གྱུར།
en: Ten million treasures appeared,

source: །ཞུགས་ཤིང་ཀུན་ཀྱང་མངོན་པར་ཁ་འབུས་ཏེ།
en: The buds of all trees opened,

source: །སྟེང་གི་མཁའ་ལས་རོལ་མོའི་སྒྲ་ཡང་བྱུང་།
en: And the sound of music came from the sky.

source: །འཛམ་བུ་རྒྱལ་མཚན་སེམས་ཅན་ཐམས་ཅད་ཀྱང་།
en: ‘All the beings in Jambudhvaja

source: །ཁྱོད་ལ་མངོན་ལྟ་བཏུད་ཅིང་ཕྱག་ཀྱང་འཚལ།
en: Gazed upon you, bowed, and paid homage.

source: །ཐལ་མོ་སྦྱར་ཅིང་ཀྱེ་མ་མགོན་མེད་པའི།
en: With palms together they said with joy,

source: །མགོན་ཞིག་བྱུང་ཞེས་དགའ་བའི་ཚིག་ཀྱང་བརྗོད།
en: You have come as a protector for the helpless!”

source: །ཁྱོད་ཀྱི་སྐུ་ལས་འོད་གཟེར་མང་བྱུང་བས།
en: ‘From your body you radiated light rays

source: །དོག་ས་ཀུན་ཏུ་རབ་ཏུ་སྣང་བར་གྱུར།
en: That illuminated the entire world,

source: །འགྲོ་བའི་མུན་པ་ཀུན་ཀྱང་རྣམ་བསྩལ་ནས།
en: Eliminating all the darkness in beings

source: །ནད་མང་མ་ལུས་རབ་ཏུ་ཞི་བར་གྱུར།
en: And bringing to an end every kind of illness.

source: །གནོད་སྦྱིན་གྲུལ་བུམ་ཤ་ཟ་མང་པོའི་ཚོགས།
en: ‘Those gatherings of yakṣas, kumbhāṇḍas, and piśācas

source: །རྣམ་པར་འཚེ་བ་དེ་དག་བསྩལ་བར་གྱུར།
en: Who were causing harm were dispelled.

source: །ཤིན་ཏུ་གདུག་པས་སེམས་ཅན་འགུམ་པ་ཡི། །སྦྲུལ་གདུག་ཀུན་ཀྱང་དེ་ཚེ་ཡོངས་མི་རྒྱུ།
en: All poisonous snakes, who with malicious intent Killed beings, were rendered immobile. “ ‘The suffering of misfortune and disgrace,

source: །ཐོབ་མེད་སྨད་པ་མི་སྙན་སྡུག་བསྔལ་དང་། །ནད་རླུང་ནད་མང་གནོད་པར་འཚེ་བ་དག །མདོར་བསྡུ་ཀུན་ཀྱང་ཞི་ཞིང་མ་མཆིས་གྱུར།
en: Being afflicted by illness, harmed by many illnesses All these were, in brief, brought to an end, ceased to exist,

source: །འཇིག་རྟེན་ཀུན་ཏུ་རབ་དགའ་བྱུང་བར་གྱུར།
en: And there was great happiness throughout the entire world. “ ‘At that time, all beings had loving minds,

source: །ཕན་ཚུན་མ་དང་འདྲ་བའི་འདུ་ཤེས་ཀྱིས། །ཁོང་ནས་བྱམས་པར་དེ་ཚེ་འགྲོ་ཀུན་གྱུར།
en: Perceiving one another as being like their mother.

source: །ཤར་གཉེར་སེམས་བྲལ་འཚེ་བ་མ་མཆིས་ཏེ།
en: Without aggression and without violence,

source: །ཐམས་ཅད་མཁྱེན་ལམ་ནན་ཏན་ལྡན་པར་གྱུར།
en: They practiced the path to omniscience. “ ‘They were turned away from the lower existences,

source: །ངན་སོང་རྒྱུད་རྣམས་རྣམ་པར་རབ་ཏུ་བཟློག །མཐོ་རིས་ལམ་ཆེན་ཀུན་ཀྱང་བཏོད་པར་གྱུར།
en: Turned toward the great path to higher existences,

source: །ཐམས་ཅད་མཁྱེན་པའི་ལམ་ཡང་ཤིན་ཏུ་བསྟན།
en: And shown the path toward omniscience.

source: །དེ་ལྟར་ཁྱོད་ཀྱིས་འགྲོ་དོན་ཡངས་པ་མཛད།
en: In that way you created a vast benefit for beings.

source: །རྒྱ་མཚོ་ཆེ་འདྲ་ཡོངས་སུ་གཏོང་མཛད་པ།
en: ‘Your generosity has been as vast as an ocean.

source: །ཁྱོད་མཐོང་བདག་ནི་ཐོབ་པ་དམ་པ་ཐོབ། །ཡུན་རིང་འཁྱམས་པའི་འགྲོ་བ་མགོན་བྲལ་དུ།
en: I have attained the excellent attainment of seeing you.

source: །ཁྱོད་ནི་རྨད་དུ་བྱུང་བའི་མགོན་ཞིག་གཤེགས།
en: You have come to be a marvelous guide For those who have been helplessly lost for a long time.’

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ཀྱིས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་དེ།
en: “The head merchant’s daughter, Ratnaprabhā, praised King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa with those verses.

source: སྙན་པར་བཀུར་ནས་རབ་ཏུ་བསྔགས་ཏེ། ལན་བརྒྱ་ཕྲག་སྟོང་དུ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: Having honored and praised him, she circumambulated him, keeping him to her right, a hundred thousand times.

source: ཕྱག་འཚལ་ནས་ཕྱོགས་གཅིག་ཏུ་གུས་པའི་ཚུལ་གྱིས་འདུག་གོ །དེ་ནས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས།
en: Having paid homage, she reverently went to sit to one side.

source: ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ལ་བལྟས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa looked at the merchant’s daughter Ratnaprabhā and said these words:

source: །བུ་མོ་དེ་ལྟར་ཁྱོད་སེམས་ཅན་ཕ་རོལ་གྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཤེས་པའི་མངོན་པར་ཤེས་པ་ལ་ཞུགས་པ་ལེགས་སོ་ལེགས་སོ།
en: ‘Girl, it is excellent, excellent, that you have thus set out for the higher knowledge that knows the special qualities of other beings.

source: །བུ་མོ་འཇིག་རྟེན་ཐམས་ཅད་ནའང་སེམས་ཅན་གང་སེམས་ཅན་ཕ་རོལ་གྱི་ཡོན་ཏན་ལ་མོས་པ་དེ་ལྟ་བུ་ནི་དཀོན་ཏེ། བུ་མོ་སེམས་ཅན་མུན་པས་བསྒྲིབས་པས་ཕན་བཏགས་པ་ལ་དྲིན་དུ་མི་གཟོ་བའི། བློ་ཕྱིན་ཅི་ལོག་ལ་ཞུགས་པ་སེམས་འཁྲུགས་པར་གྱུར་པ།
en: ‘Girl, beings who aspire for the good qualities in other beings are rare in all worlds.

source: རྒྱུད་འཛིངས་པར་གྱུར་པ། མུན་པའི་སེམས་དང་ལྡན་པ། བསམ་པ་ངང་གིས་ལོག་པ། ནན་ཏན་དང་མྱི་ལྡན་པ། སེམས་ཅན་ཕ་རོལ་གྱི་ཡོན་ཏན་གྱི་ཁྱད་པར་མངོན་པར་མི་ཤེས་པ་རྣམས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ལ་འཇུག་པར་བྱ་བའམ།
en: ‘Girl, beings who are obscured by darkness, who are ungrateful, who have wrong judgment, who have disturbed minds, whose trains of thought are in disorder, whose minds are in darkness, whose thoughts are naturally ruinous, who do not practice, and who do not know the special qualities of other beings are unable to comprehend the qualities of bodhisattvas, to conceive the qualities of the tathāgatas, or to attain the higher cognition that is the unique knowledge of all qualities.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ལ་བརྟག་པར་བྱ་བའམ། ཡོན་ཏན་ཐམས་ཅད་ཤེས་པའི་ཁྱད་པར་མངོན་པར་ཤེས་པ་ཐོབ་པར་བྱ་བར་མི་ནུས་སོ། །བུ་མོ་དེ་ལྟར་ཁྱོད་སེམས་ཅན་ཆེན་པོ་མངོན་པར་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་རྣམ་པ་དེ་ལྟ་བུ་ལ་འཇུག་པ་ནི་གདོན་མི་ཟ་བར་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པའོ།
en: ‘Therefore, girl, as you comprehend the qualities of the bodhisattvas through a higher cognition of great beings, you are, without doubt, established in the way to enlightenment.

source: །དེ་ལྟར་ངའི་ཁམས་སུ་ཁྱོད་ལྟ་བུ་ཡེ་ཤེས་དེ་འདྲ་བ་དང་ལྡན་པ་སྐྱེས་པ་ནི། འཛམ་བུའི་གླིང་དུ་ངས་སེམས་ཅན་ཡོངས་སུ་བསྡུས་པའི་མཐུ་དོན་ཡོད་དོ།
en: ‘My prowess in gathering together the beings of Jambudvīpa has proved meaningful because someone like you, with your kind of knowledge, has been born in my realm.’

source: །དེ་ནས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་རིན་ཐང་མེད་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་འོད་སྣ་ཚོགས་དང་། གོས་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་བདག་གིས་ལག་བདར་ཏེ་བླངས་ནས། ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ལ་བྱིན་ནོ།
en: “Then King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa picked up with his own hands a great, priceless, precious jewel, a multicolored precious jewel that contained the lights of the stars, and priceless, precious clothing, and gave them to the head merchant’s daughter Ratnaprabhā.

source: །དེའི་འཁོར་གྱི་བུ་མོ་ཐམས་ཅད་ཀྱང་གོས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཁྱེད་པར་བྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He gave various precious clothing to each of the girls in Ratnaprabhā’s entourage.

source: །བུ་མོ་གོས་རིན་པོ་ཆེ་འདི་ཁྱེར་ལ་བདག་གིས་ཡོངས་སུ་སྤྱད་པར་གྱིས་ཤིགདེ་ནས་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་འཁོར་དང་བཅས་པས་པུས་མོ་གཉིས་ས་ལ་ཕབ་སྟེ།
en: He said, ‘Girl, take this precious clothing, keep it, and wear it yourself!’

source: གོས་རིན་པོ་ཆེ་དེ་དག་ལག་པ་གཉིས་ཀྱིས་བླངས་ནས་སྤྱི་པོ་ལ་བླངས་ཏེ།
en: “Then the head merchant’s daughter, Ratnaprabhā, accompanied by her entourage, knelt with both knees on the ground, took up the precious clothing with both hands, placed it on her head, withdrew, and put on that precious clothing.

source: ཕྱིར་ཕྱུང་ནས་གོས་རིན་པོ་ཆེ་དེ་དག་བགོས་སོ། །དེའི་འཁོར་གྱི་བུ་མོ་ཐམས་ཅད་ཀྱིས་ཀྱང་སོ་སོ་ནས་རང་རང་གི་གོས་རིན་པོ་ཆེ་དེ་དག་བགོས་ནས།
en: All the girls in the entourage also each put on their own precious clothing.

source: དེས་གོས་རིན་པོ་ཆེ་དེ་དག་བགོས་པའི་འོག་ཏུ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་བདག་གི་འཁོར་བུ་མོ་དེ་དག་དང་བཅས་པས་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་སོ།
en: When she had put on that precious clothing, accompanied by her entourage of girls, she circumambulated King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa, keeping him to her right.

source: །དེ་དག་ཐམས་ཅད་ཀྱི་གོས་རིན་པོ་ཆེ་དེ་དག་ལ་རྒྱུ་སྐར་དང་སྐར་མ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་སྣང་བར་གྱུར་ཏེ།
en: The images of all constellations and stars appeared on those precious clothes.

source: དེ་དག་མཐོང་ནས་འགྲོ་བའི་ཚོགས་མང་པོ་འདི་སྐད་ཅེས་འཛེར་ཏེ། བུ་མོ་ཁྱོད་ཀྱི་འཁོར་བུ་མོ་འདི་དག་ནི་མཚན་མོའི་ལྷ་མོ་སྐར་མའི་ཚོགས་ཀྱིས་བརྒྱན་པ་ལྟར་ཤིན་ཏུ་མཛེས་པ་སྟེ།
en: When the gathering of people saw her, they said, ‘Girl, your entourage of girls is as beautiful as a night goddess adorned by the stars.

source: ཁྱོད་དེ་དག་གིས་བསྐོར་བས་གྱ་ནོམ་པར་མཛེས་སོ།
en: You, encircled by them, are even more beautiful.’

source: །དེ་ནས་མཚན་མོའི་ལྷ་མོ་ཤིང་ཐམས་ཅད་ཀྱི་མེ་ཏོག་རྒྱས་པས་བདེ་བར་གནས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the night goddess Sarva­vṛkṣpraphullana­sukha­saṃvāsā said to Sudhana, “Noble one, what do you think?

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན། དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: Do not think that it was anyone else, for at that time, in that time, it was this bhagavat tathāgata arhat samyak­saṃbuddha Vairocana who was King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་འདི་ནི།
en: “What do you think, noble one?
